{
    "es": {
        "role": "Soy diseñador, desarrollador, devsigner",
        "contactMe": "Contactame",
        "writeMe": "Escribime",
        "myCv": "Mi CV",
        "aboutMeTitle": "Un poco sobre mi",
        "aboutMe": "Tengo 25 años. Soy licenciado en Diseño Multimedial, recibido en la Universidad Nacional de La Plata. Resido en Quilmes, Buenos Aires, Argentina. Me especializo en el área web, utilizando herramientas de diseño como también lenguajes de programación para el desarrollo de páginas.",
        "myExperienceTitle": "Mi experiencia",
        "devsignerFreelo": "Diseñador Web y Desarrollador Front-end",
        "devsignerFreeloIntro": "Durante mi trayectoria freelance desarrollé soluciones digitales en WordPress, Elementor Pro y WooCommerce, así como proyectos a medida con Astro, TailwindCSS y JavaScript. Todos los sitios fueron diseñados en base a prototipos creados en Figma y diversas herramientas de diseño UI/UX.",

        "devsignerFreeloSpan": "Freelance | Abril 2024 - Actualidad",
        "devsignerFreeloBB1": "· Realicé el diseño de la WebApp OnePage, incluyendo el Login.",
        "devsignerFreeloBB2": "· Realicé el desarrollo de un iframe para la descripción de productos de la plataforma de Ebay.",
        "devsignerFreeloBonte1": "· Diseñe toda la página web con Figma.",
        "devsignerFreeloBonte2": "· Realicé el desarrollo de la página web con Astro, TailwindCSS y TypeScript/JS.",
        "devsignerFreeloBonte3": "· Implementé SEO mediante sus correspondientes etiquetas y OpenGraph.",
        "devsignerFreeloBonte4": "· Generé páginas dinámicas mediante el uso de API Restful.",
        "devsignerFreeloKzUnico": "· Implementé ClientRouter desde Astro y formularios con Web3Forms.",
        "devsignerFreeloKz1": "· Diseñé toda la página web con Figma.",
        "devsignerFreeloKz2": "· Realicé el desarrollo de la página web con Astro, TailwindCSS y TypeScript/JS.",
        "devsignerFreeloKz3": "· Implementé SEO mediante sus correspondientes etiquetas y OpenGraph.",
        "devsignerFreeloNexiumTitle": "Trabajos con Nexium Solutions:",
        "devsignerFreeloJugasoTitle": "Jugaso (Página minorista, no jugaso.com):",
        "devsignerFreeloJugaso1": "· Desarrollé la página completa con WordPress, Elementor Pro y WooCommerce.",
        "devsignerFreeloJugaso2": "· Me encargué del diseño y estructuración con Elementor Pro.",
        "devsignerFreeloJugaso3": "· Hice uso de complementos para mayor legibilidad y funcionalidad como sistema de filtros, carrito de compras custom, selectores dinámicos de features, etc.",
        "devsignerFreeloAxelFauth1": "· Diseñé toda la página web con Figma.",
        "devsignerFreeloAxelFauth2": "· Realicé el desarrollo de la página web con Astro, TailwindCSS y TypeScript/JS.",
        "devsignerFreeloAxelFauthUnico": "· Implementé el sistema DarkMode con TailwindCSS.",
        "devsignerFreeloDobleG1": "· Desarrollé la página completa con WordPress, Elementor Pro y WooCommerce.",
        "devsignerFreeloDobleG2": "· Me encargué principalmente del desarrollo del mini-resumen dinámico de los productos en donde calcula el precio.",
        "devsignerFreeloDobleG3": "· Realicé la integración del precio dinámico con WooCommerce, y plugin Override para que Nave lo detectara correctamente.",
        "teachAssistant": "Ayudante y Tutor de Programación en Unity",
        "teachAssistantSpan": "Universidad Nacional de La Plata | Sep. 2023 - Actualidad",
        "teachAssistantSub": "Catedra Taller de Diseño de Experiencias Interactivas",
        "teachAssistantSub1": "· Despeje y resolví dudas de los alumnos a partir de la programación en Unity con C#.",
        "teachAssistantSub2": "· Me encargué de manejo de código del Template que brindamos en Unity, además de brindar soporte con respecto a sensores y herramientas alternativas del programa.",
        "teachAssistantSub3": "· Fui parte del manejo de la plataforma de Discord como medio de comunicación principal para el contacto con los alumnos.",
        "myProjects": "Mis proyectos",
        "kzGroupDesc": "KZ es una empresa dedicada a brindar soluciones integrales en el mundo automotriz. Esta página integra ClientRouter de Astro para optimizar la navegación, un sistema de cambio de idioma navegación, SEO optimizada y diseño responsive.",
        "dobleGDesc": "Realizada con Nexium Solutions y DiTiero, DobleG es una empresa de diseño de interiores. Me dedique a estructurar la página con Elementor Pro; implementar el mini-resumen de compra con JavaScript; integrar con WooCommerce y PHP para el pago.",
        "axelFauthDesc": "Página web para el doctor Axel Fauth, con Nexium Solutions y DiTiero. Esta página cuenta con intercambio entre modo oscuro y claro, integración de carrusel con Siema y diferentes transiciones con TAOS.",
        "bonteDesc": "Una página web para Bonté, una empresa de decoración de interiores. Muestra sus principales productos, su catálogo con variedad de productos, una sección de preguntas frecuentes y un contacto funcional con Netlify Forms.",
        "bbDesc": "Diseño de interfaz hecho para la empresa B&B Racing Parts, con la necesidad de generar una plataforma funcional y con buena usabilidad. Se incluye diseño de Login, plataforma principal One Page y el sistema de filtros.",
        "boxedDesc": "Este es un proyecto personal. Una simulación de una nota, en este caso de una entrevista, en donde hay elementos interactivos como el poder guardar una nota, poder valorar la nota y comentar en ella.",
        "freneticDesc": "Otro proyecto personal. Una landing page hecha en 2020, readaptada en 2024 para una mejor legibilidad y usabilidad. Basado en un diseño de ese mismo año hecho por mi.",
        "portfolioDesc": "La versión anterior de mi portfolio, el cual fue mi primer proyecto con SASS. Mi inspiración se baso en este estilo de navegación tan particular, con divisores fijos. Cuenta con la animación de la tarjeta de presentación y un sistema de scroll-snap en la zona de proyectos.",
        "font": "Tipografías",
        "fonts": "Tipografías",
        "colors": "Colores",
        "mySkills": "Mis habilidades",
        "mySkillsDesign": "De diseño",
        "mySkillsDev": "De desarrollo",
        "myCertificates": "Mis certificados",
        "certName1": "Licenciatura en Diseño Multimedial",
        "certName2": "Curso Full-Stack Node.js",
        "viewCert": "Ver certificado",
        "navMenu1": "Sobre mi",
        "navMenu2": "Experiencia",
        "navMenu3": "Proyectos",
        "navMenu4": "Habilidades",
        "navMenu5": "Contacto"
    },
    "en": {
        "role": "I am designer, developer, devsigner",
        "contactMe": "Contact me",
        "writeMe": "Write me",
        "myCv": "My CV",
        "aboutMeTitle": "A little about me",
        "aboutMe": "I am 25. I have a degree in Multimedia Design, graduated from Universidad Nacional de La Plata. I live in Quilmes, Buenos Aires, Argentina. I am a specialist in the web area, where I use design tools as well as programming languages for the development of web pages.",
        "myExperienceTitle": "My experience",
        "devsignerFreelo": "Web Designer and Frontend Developer",
        "devsignerFreeloIntro": "During my freelance career, I developed digital solutions in WordPress, Elementor Pro, and WooCommerce, as well as custom projects with Astro, TailwindCSS, and JavaScript. All sites were designed based on prototypes created in Figma and various UI/UX design tools.",

        "devsignerFreeloSpan": "Freelance | April 2024 - Current",
        "devsignerFreeloBB1": "· I have done the design of the OnePage WebApp, including the Login section.",
        "devsignerFreeloBB2": "· I have done the development of an iframe for the description of products on the Ebay platform.",
        "devsignerFreeloBonte1": "· I designed the whole website with Figma.",
        "devsignerFreeloBonte2": "· I developed the website with Astro, TailwindCSS and TypeScript/JS.",
        "devsignerFreeloBonte3": "· I implemented SEO using corresponding tags and OpenGraph.",
        "devsignerFreeloBonte4": "· I generated dynamic pages using Restful API.",
        "devsignerFreeloKzUnico": "· I implemented ClientRouter from Astro and forms with Web3Forms.",
        "devsignerFreeloKz1": "· I designed the whole website with Figma.",
        "devsignerFreeloKz2": "· I developed the website with Astro, TailwindCSS and TypeScript/JS.",
        "devsignerFreeloKz3": "· I implemented SEO using corresponding tags and OpenGraph.",
        "devsignerFreeloNexiumTitle": "Work with Nexium Solutions:",
        "devsignerFreeloJugasoTitle": "Jugaso (Retail page, not jugaso.com):",
        "devsignerFreeloJugaso1": "· I developed the complete page with WordPress, Elementor Pro and WooCommerce.",
        "devsignerFreeloJugaso2": "· I was in charge of design and structuring with Elementor Pro.",
        "devsignerFreeloJugaso3": "· I used plugins for better readability and functionality such as filter system, custom shopping cart, dynamic feature selectors, etc.",
        "devsignerFreeloAxelFauth1": "· I designed the whole website with Figma.",
        "devsignerFreeloAxelFauth2": "· I developed the website with Astro, TailwindCSS and TypeScript/JS.",
        "devsignerFreeloAxelFauthUnico": "· I implemented the DarkMode system with TailwindCSS.",
        "devsignerFreeloDobleG1": "· I developed the complete page with WordPress, Elementor Pro and WooCommerce.",
        "devsignerFreeloDobleG2": "· I was mainly in charge of developing the dynamic mini-summary of products where it calculates the price.",
        "devsignerFreeloDobleG3": "· I implemented dynamic pricing integration with WooCommerce, and Override plugin so that Nave would detect it correctly.",
        "teachAssistant": "Teaching Assistant and Unity Programming Tutor",
        "teachAssistantSpan": "Universidad Nacional de La Plata | Sept. 2023 - Current",
        "teachAssistantSub": "Taller de Diseño de Experiencias Interactivas",
        "teachAssistantSub1": "· I cleared and solved doubts of the students from Unity programming with C#.",
        "teachAssistantSub2": "· I was in charge of managing the code of the Template we provide in Unity, as well as providing support with regard to sensors and alternative tools of the program.",
        "teachAssistantSub3": "· I was part of the management of the Discord platform as the main communication for contact with students.",
        "myProjects": "My projects",
        "kzGroupDesc": "KZ is a company dedicated to providing comprehensive solutions in the automotive world. This page integrates ClientRouter from Astro to optimize navigation, a navigation system with language change, optimized SEO and responsive design.",
        "dobleGDesc": "Realized with Nexium Solutions and DiTiero, DobleG is an interior design company. I was responsible for structuring the page with Elementor Pro; implementing the mini-purchase summary with JavaScript; integrating with WooCommerce and PHP for payment.",
        "bonteDesc": "A web page for Bonté, an interior decoration company. It shows their main products, their catalog with a variety of products, a FAQ section and a functional contact with Netlify Forms.",
        "axelFauthDesc": "Web page for Dr. Axel Fauth, with Nexium Solutions and DiTiero. This page includes dark/light mode switch, carousel integration with Siema and different transitions with TAOS.",
        "bbDesc": "Interface design made for the company B&B Racing Parts, with the need to generate a functional platform with good usability. It includes Login design, One Page main platform and the filter system.",
        "boxedDesc": "This is a personal project. A simulation of a note, in this case of an interview, where there are interactive elements such as the ability to save a note, to rate the note and to comment on it. This design includes a registration and login functional with localStorage.",
        "freneticDesc": "Another personal project. A landing page made in 2020, readapted in 2024 for readability and usability. Based on a design made by me, Mobile First and Responsive for any device.",
        "portfolioDesc": "The previous version of my portfolio, which was my first project with SASS. My inspiration was based on this particular navigation style, with fixed dividers. It has the animation of the presentation card and a scroll-snap system in the projects area.",
        "font": "Font",
        "fonts": "Fonts",
        "colors": "Colors",
        "mySkills": "My skills",
        "mySkillsDesign": "Design",
        "mySkillsDev": "Development",
        "myCertificates": "My certificates",
        "certName1": "Multimedia Design Bachelor's Degree",
        "certName2": "Full-Stack Node.js Course",
        "viewCert": "View certificate",
        "navMenu1": "About me",
        "navMenu2": "Experience",
        "navMenu3": "Projects",
        "navMenu4": "Skills",
        "navMenu5": "Contact"
    }
}