{
    "es": {
        "role": "Soy <span class='txt-rotate' data-period='2000' data-rotate='[\"diseñador\", \"desarrollador\", \"devsigner\"]'></span>",
        "contactMe": "Contactame",
        "writeMe": "Escribime",
        "myCv": "Mi CV",
        "aboutMeTitle": "Un poco <span class='text-[#055a97] dark:text-[#3D7AFF]'>sobre mi</span>",
        "aboutMe": "Tengo 25 años. Soy licenciado en Diseño Multimedial, recibido en la Universidad Nacional de La Plata. Resido en Quilmes, Buenos Aires, Argentina. Me especializo en el área web, utilizando herramientas de diseño como también de lenguajes de programación para el desarrollo de páginas.",
        "myExperienceTitle": "Mi experiencia",
        "devsignerFreelo": "Diseñador Web y Desarrollador Front-end",
        "devsignerFreeloSpan": "Freelance | Abril 2024 - Actualidad",
        "devsignerFreeloBB1": "· Realice el diseño de la WebApp OnePage, incluyendo el Login.",
        "devsignerFreeloBB2": "· Realice el desarrollo de un iframe para la descripción de productos de la plataforma de Ebay.",
        "devsignerFreeloBonte1": "· Diseñe toda la pagina web con Figma.",
        "devsignerFreeloBonte2": "· Realice el desarrollo de la pagina web con Astro, TailwindCSS y TypeScript/JS.",
        "devsignerFreeloBonte3": "· Implemente SEO mediante sus correspondientes etiquetas y OpenGraph.",
        "devsignerFreeloBonte4": "· Diseñe y genere paginas dinámicas mediante el uso de API Restful.",
        "teachAssistant": "Ayudante y Tutor de Programación en Unity",
        "teachAssistantSpan": "Universidad Nacional de La Plata | Sep. 2023 - Dic. 2024",
        "teachAssistantSub": "Catedra Taller de Diseño de Experiencias Interactivas",
        "teachAssistantSub1": "· Despeje y resolví dudas de los alumnos a partir de la programación en Unity con C#.",
        "teachAssistantSub2": "· Fui parte del manejo de la plataforma de Discord como medio de comunicación principal para el contacto con los alumnos.",
        "myProjects": "Mis proyectos",
        "bonteDesc": "Una página web para Bonté, una empresa de decoración de interiores. Muestra sus principales productos, su catálogo con variedad de productos, una sección de preguntas frecuentes y un contacto funcional con Netlify Forms.",
        "bbDesc": "Diseño de interfaz hecho para la empresa B&B Racing Parts, con la necesidad de generar una plataforma funcional y con buena usabilidad. Se incluye diseño de Login, plataforma principal One Page y el sistema de filtros.",
        "boxedDesc": "Este es un proyecto personal. Una simulación de una nota, en este caso de una entrevista, en donde hay elementos interactivos como el poder guardar una nota, poder valorar la nota y comentar en ella.",
        "freneticDesc": "Otro proyecto personal. Una landing page hecha en 2020, readaptada en 2024 para una mejor legibilidad y usabilidad. Basado en un diseño de ese mismo año hecho por mi.",
        "portfolioDesc": "La versión anterior de mi portfolio, el cual fue mi primer proyecto con SASS. Mi inspiración se baso en este estilo de navegación tan particular, con divisores fijos. Cuenta con la animación de la tarjeta de presentación y un sistema de scroll-snap en la zona de proyectos.",
        "font": "Tipografías",
        "fonts": "Tipografías",
        "colors": "Colores",
        "mySkills": "Mis habilidades",
        "mySkillsDesign": "De diseño",
        "mySkillsDev": "De desarrollo",
        "myCertificates": "Mis certificados",
        "certName1": "Licenciatura en Diseño Multimedial",
        "certName2": "Curso Full-Stack Node.js",
        "viewCert": "Ver certificado",
        "navMenu1": "Sobre mi",
        "navMenu2": "Experiencia",
        "navMenu3": "Proyectos",
        "navMenu4": "Habilidades",
        "navMenu5": "Contacto"
    },
    "en": {
        "role": "I am <span class='txt-rotate' data-period='2000' data-rotate='[\"designer\", \"developer\", \"devsigner\"]'></span>",
        "contactMe": "Contact me",
        "writeMe": "Write me",
        "myCv": "My CV",
        "aboutMeTitle": "A little <span class='text-[#055a97] dark:text-[#3D7AFF]'>about me</span>",
        "aboutMe": "I am 25. I have a degree in Multimedia Design, graduated from Universidad Nacional de La Plata. I live in Quilmes, Buenos Aires, Argentina. I am a specialist in the web area, where I use design tools as well as programming languages for the development of web pages.",
        "myExperienceTitle": "My experience",
        "devsignerFreelo": "Web Designer and Frontend Developer",
        "devsignerFreeloSpan": "Freelance | April 2024 - Current",
        "devsignerFreeloBB1": "· I have done the design of the OnePage WebApp, including the Login section. ",
        "devsignerFreeloBB2": "· I have done the development of an iframe for the description of products on the Ebay platform.",
        "devsignerFreeloBonte1": "· I designed the whole website with Figma.",
        "devsignerFreeloBonte2": "· I developed the website with Astro, TailwindCSS and TypeScript/JS.",
        "devsignerFreeloBonte3": "· I implemented SEO using corresponding tags and OpenGraph.",
        "devsignerFreeloBonte4": "· I design and generate dynamic pages using Restful API.",
        "teachAssistant": "Teaching Assistant and Unity Programming Tutor",
        "teachAssistantSpan": "Universidad Nacional de La Plata | Sept. 2023 - Dec. 2024",
        "teachAssistantSub": "Taller de Diseño de Experiencias Interactivas",
        "teachAssistantSub1": "· I cleared and solved doubts of the students from Unity programming with C#.",
        "teachAssistantSub2": "· I was part of the management of the Discord platform as the main communication for contact with students.",
        "myProjects": "My projects",
        "bonteDesc": "A landing page for Bonté, an interior decoration company. It shows their main products, their catalog with a variety of products, a FAQ section and a functional contact with Netlify Forms.",
        "bbDesc": "Interface design made for the company B&B Racing Parts, with the need to generate a functional platform with good usability. It includes Login design, One Page main platform and the filter system.",
        "boxedDesc": "This is a personal project. A simulation of a note, in this case of an interview, where there are interactive elements such as the ability to save a note, to rate the note and to comment on it. This design includes a registration and login functional with localStorage.",
        "freneticDesc": "Another personal project. A landing page made in 2020, readapted in 2024 for readability and usability. Based on a design made by me, Mobile First and Responsive for any device.",
        "portfolioDesc": "The previous version of my portfolio, which was my first project with SASS. My inspiration was based on this particular navigation style, with fixed dividers. It has the animation of the presentation card and a scroll-snap system in the projects area.",
        "font": "Font",
        "fonts": "Fonts",
        "colors": "Colors",
        "mySkills": "My skills",
        "mySkillsDesign": "Design",
        "mySkillsDev": "Development",
        "myCertificates": "My certificates",
        "certName1": "Multimedia Design Bachelor's Degree",
        "certName2": "Full-Stack Node.js Course",
        "viewCert": "View certificate",
        "navMenu1": "About me",
        "navMenu2": "Experience",
        "navMenu3": "Projects",
        "navMenu4": "Skills",
        "navMenu5": "Contact"
    }
}